---
kind: type
id: T:Autodesk.Revit.DB.Structure.TrussCurveType
source: html/fa60989a-560f-93d2-cbef-5ab2e35a4fb6.htm
---
# Autodesk.Revit.DB.Structure.TrussCurveType

Types of curves created in truss families.

## Syntax (C#)
```csharp
public enum TrussCurveType
```